{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "Вам дано описание наследования классов исключений в следующем формате. \n",
    "<имя исключения 1> : <имя исключения 2> <имя исключения 3> ... <имя исключения k>\n",
    "Это означает, что исключение 1 наследуется от исключения 2, исключения 3, и т. д.\n",
    "\n",
    "Или эквивалентно записи:\n",
    "class Error1(Error2, Error3 ... ErrorK):\n",
    "    pass\n",
    "\n",
    "Антон написал код, который выглядит следующим образом.\n",
    "\n",
    "try:\n",
    "   foo()\n",
    "except <имя 1>:\n",
    "   print(\"<имя 1>\")\n",
    "except <имя 2>:\n",
    "   print(\"<имя 2>\")\n",
    "...\n",
    "Костя посмотрел на этот код и указал Антону на то, что некоторые исключения можно не ловить, так как ранее в коде будет пойман их предок. Но Антон не помнит какие исключения наследуются от каких. Помогите ему выйти из неловкого положения и напишите программу, которая будет определять обработку каких исключений можно удалить из кода.\n",
    "\n",
    "Важное примечание:\n",
    "В отличие от предыдущей задачи, типы исключений не созданы.\n",
    "Создавать классы исключений также не требуется\n",
    "Мы просим вас промоделировать этот процесс, и понять какие из исключений можно и не ловить, потому что мы уже ранее где-то поймали их предка.\n",
    "\n",
    "Формат входных данных\n",
    "В первой строке входных данных содержится целое число n - число классов исключений.\n",
    "\n",
    "В следующих n строках содержится описание наследования классов. В i-й строке указано от каких классов наследуется i-й класс. Обратите внимание, что класс может ни от кого не наследоваться. Гарантируется, что класс не наследуется сам от себя (прямо или косвенно), что класс не наследуется явно от одного класса более одного раза.\n",
    "\n",
    "В следующей строке содержится число m - количество обрабатываемых исключений.\n",
    "Следующие m строк содержат имена исключений в том порядке, в каком они были написаны у Антона в коде.\n",
    "Гарантируется, что никакое исключение не обрабатывается дважды.\n",
    "\n",
    "Формат выходных данных\n",
    "Выведите в отдельной строке имя каждого исключения, обработку которого можно удалить из кода, не изменив при этом поведение программы. Имена следует выводить в том же порядке, в котором они идут во входных данных.\n",
    "\n",
    "Пример теста 1\n",
    "Рассмотрим код\n",
    "\n",
    "try:\n",
    "   foo()\n",
    "except ZeroDivision :\n",
    "   print(\"ZeroDivision\")\n",
    "except OSError:\n",
    "   print(\"OSError\")\n",
    "except ArithmeticError:\n",
    "   print(\"ArithmeticError\")\n",
    "except FileNotFoundError:\n",
    "   print(\"FileNotFoundError\")\n",
    "\n",
    "\n",
    "...\n",
    "\n",
    "\n",
    "По условию этого теста, Костя посмотрел на этот код, и сказал Антону, что исключение FileNotFoundError можно не ловить, ведь мы уже ловим OSError -- предок FileNotFoundError\n",
    "Sample Input:\n",
    "\n",
    "4\n",
    "ArithmeticError\n",
    "ZeroDivisionError : ArithmeticError\n",
    "OSError\n",
    "FileNotFoundError : OSError\n",
    "4\n",
    "ZeroDivisionError\n",
    "OSError\n",
    "ArithmeticError\n",
    "FileNotFoundError\n",
    "Sample Output:\n",
    "\n",
    "FileNotFoundError"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "classExceptions = {}\n",
    "exceptionList = []\n",
    "\n",
    "def findParentException(excepts):\n",
    "    if excepts in classExceptions.keys():\n",
    "        exceptsParents = []\n",
    "        if len(classExceptions[excepts]) != 0:\n",
    "            parents = [i for i in classExceptions[excepts]]\n",
    "            for i in parents:\n",
    "                exceptsParents.append(i)\n",
    "            for thisExcept in exceptsParents:\n",
    "                if thisExcept in exceptionList:\n",
    "                    return True\n",
    "                    break\n",
    "                else:\n",
    "                    res = findParentException(thisExcept)\n",
    "                    if res is True:\n",
    "                        return True\n",
    "    else:\n",
    "        return\n",
    "for n in range(int(input())):\n",
    "    exceptions = [str(i) for i in input().split()]\n",
    "    if exceptions[0] not in classExceptions:\n",
    "        if (len(exceptions)) == 1:\n",
    "            classExceptions[exceptions[0]] = set()\n",
    "        else:\n",
    "            classExceptions[exceptions[0]] = {exceptions[i] for i in range(2, len(exceptions))}\n",
    "    else:\n",
    "        for c in range(2, len(exceptions)):\n",
    "            classExceptions[exceptions[0]].add(exceptions[c])\n",
    "for q in range(int(input())):\n",
    "    excepts = input()\n",
    "    exceptionList.append(excepts)\n",
    "    res = findParentException(excepts)\n",
    "    if res is True:\n",
    "        print(excepts)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
