{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "Вам дано описание наследования классов в следующем формате. \n",
    "<имя класса 1> : <имя класса 2> <имя класса 3> ... <имя класса k>\n",
    "Это означает, что класс 1 отнаследован от класса 2, класса 3, и т. д.\n",
    "\n",
    "Или эквивалентно записи:\n",
    "\n",
    "class Class1(Class2, Class3 ... ClassK):\n",
    "    pass\n",
    "Класс A является прямым предком класса B, если B отнаследован от A:\n",
    "\n",
    "\n",
    "class B(A):\n",
    "    pass\n",
    "\n",
    "\n",
    "Класс A является предком класса B, если \n",
    "A = B;\n",
    "A - прямой предок B\n",
    "существует такой класс C, что C - прямой предок B и A - предок C\n",
    "\n",
    "Например:\n",
    "class B(A):\n",
    "    pass\n",
    "\n",
    "class C(B):\n",
    "    pass\n",
    "\n",
    "# A -- предок С\n",
    "\n",
    "\n",
    "Вам необходимо отвечать на запросы, является ли один класс предком другого класса\n",
    "\n",
    "Важное примечание:\n",
    "Создавать классы не требуется.\n",
    "Мы просим вас промоделировать этот процесс, и понять существует ли путь от одного класса до другого.\n",
    "Формат входных данных\n",
    "В первой строке входных данных содержится целое число n - число классов.\n",
    "\n",
    "В следующих n строках содержится описание наследования классов. В i-й строке указано от каких классов наследуется i-й класс. Обратите внимание, что класс может ни от кого не наследоваться. Гарантируется, что класс не наследуется сам от себя (прямо или косвенно), что класс не наследуется явно от одного класса более одного раза.\n",
    "\n",
    "В следующей строке содержится число q - количество запросов.\n",
    "\n",
    "В следующих q строках содержится описание запросов в формате <имя класса 1> <имя класса 2>.\n",
    "Имя класса – строка, состоящая из символов латинского алфавита, длины не более 50.\n",
    "\n",
    "Формат выходных данных\n",
    "Для каждого запроса выведите в отдельной строке слово \"Yes\", если класс 1 является предком класса 2, и \"No\", если не является. \n",
    "\n",
    "Sample Input:\n",
    "\n",
    "4\n",
    "A\n",
    "B : A\n",
    "C : A\n",
    "D : B C\n",
    "4\n",
    "A B\n",
    "B D\n",
    "C D\n",
    "D A\n",
    "Sample Output:\n",
    "\n",
    "Yes\n",
    "Yes\n",
    "Yes\n",
    "No"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "classParent = {}                                                #Пустой словарь для хранения классов (графов)\n",
    "def findParent(parent, child):                                  #Функция по поиску предок-наследник\n",
    "    if child in classParent.keys():                             #Если ключ-наследник имеется в словаре, то: \n",
    "        if (parent == child) or (parent in classParent[child]): #Если наследник является сам себе предком или предок входит в сет                                                                     #наследника, где хранятся предки, то выводим Yes\n",
    "            return True        \n",
    "        elif parent not in classParent[child]:                  #Если предок не входит в сэт наследника\n",
    "            child = [i for i in classParent[child]]             #Создаем список всех предков, которые теперь становятся наследниками                                                                 #для дальнейшего поиска связей\n",
    "            if len(child) == 0:                                 #Если список наследников пуст, делаем вывод, что у наследника нет                                                                     #заданного по условию предка, значит ответ No\n",
    "                return False\n",
    "            else:\n",
    "                for n in child:                                 #Если наследник 1 или более, то циклом перебираем по одному                                                                           #наследнику и..\n",
    "                    nextDepth = findParent(parent, n)           #Запускаем рекурсивно функцию поиска наследник-предок и подставляем в                                                                 #нее на место наследника новое значение child                   \n",
    "                    if nextDepth is True:                       #Если результатом работы функции будет True, \n",
    "                        return True                             #то заканчиваем перебирать наследников\n",
    "                        break                                   #и останавливаемся\n",
    "    else:\n",
    "        return False                                            #Если не находим наследника в словаре, выдаем ответ No\n",
    "        \n",
    "n = int(input())                                                #Это количество вводов наследник-предок\n",
    "for j in range(n):                                              \n",
    "    classes = [str(i) for i in input().split()]                 #В список через цикл собираем все введенные значения\n",
    "    if classes[0] not in classParent:                           #Проверка, если ключа-наследника еще нет, то\n",
    "        if (len(classes)) == 1:                                 #Если введено одно значение\n",
    "            classParent[classes[0]] = set()                     #Просто содаем ключ с пустым value в виде пустого set()\n",
    "        else:\n",
    "            classParent[classes[0]] = {classes[i] for i in range(2, len(classes))} #Если введено несколько значений, то создаем пару                                                                 #ключ-наследник: значение-предок/предки\n",
    "    else:\n",
    "        for c in range(2, len(classes)):                        #Циклом перебираем значения введенных предков (известно, что предки                                                                   #начинаюся со второго индекса от [2] и до конца длины списка classes)\n",
    "            classParent[classes[0]].add(classes[c])             #Если же ключ есть, то добавляем в имеющийся ключ (мы знаем, что ключ                                                                 #всегда вводится первым, т.е. его индекс [0]) новые значения предков\n",
    "q = int(input())                                                #Количество проверок предок-наследник\n",
    "for j in range(q):\n",
    "    searchClass = [str(i) for i in input().split()]             #Вводим стандартные запросы предок-наследник и складываем в список\n",
    "    res = findParent(searchClass[0], searchClass[1])            #Запуск функции поиска предок-наследник\n",
    "    if res is True:\n",
    "        print('Yes')                                            #Вывод результата\n",
    "    else:\n",
    "        print(\"No\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
